# BuiltInFailures.GenericMEPFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GenericMEPFailures Class
BuiltInFailures Class Members See Also
---
Failures applicable to different mechanical, electrical and piping Elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class GenericMEPFailures
```

Visual Basic
---
```text
Public NotInheritable Class GenericMEPFailures
```

Visual C++
---
```text
public ref class GenericMEPFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..GenericMEPFailures
# See Also
BuiltInFailures..::..GenericMEPFailures Members
Autodesk.Revit.DB Namespace